In [2]:
import pandas as pd
df=pd.DataFrame({'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],'Age':[23, 25, 22, 24, 23],'Gender':['F', 'M', 'M', 'M', 'F'],'Score':[85, 78, 92, 70, 88]})
df

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [3]:
df.head(3)

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92

In [5]:
df[df['Gender']=='F']

    Name  Age Gender  Score
0  Alice   23      F     85
4    Eva   23      F     88

In [6]:
df['Score1']=df['Score']
df['Score2']=df['Score']

In [7]:
df

      Name  Age Gender  Score  Score1  Score2
0    Alice   23      F     85      85      85
1      Bob   25      M     78      78      78
2  Charlie   22      M     92      92      92
3    David   24      M     70      70      70
4      Eva   23      F     88      88      88

In [8]:
df['age1']=df['Age']
df

      Name  Age Gender  Score  Score1  Score2  age1
0    Alice   23      F     85      85      85    23
1      Bob   25      M     78      78      78    25
2  Charlie   22      M     92      92      92    22
3    David   24      M     70      70      70    24
4      Eva   23      F     88      88      88    23

In [9]:
df=df.drop(['Score1','Score2'],axis=1)
df=df.drop(['age1'],axis=1)
df

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [10]:
df=df.drop(3,axis=0)
df

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
4      Eva   23      F     88

In [11]:
df[(df['Gender']=='F')&(df['Score']>85)]

  Name  Age Gender  Score
4  Eva   23      F     88

In [12]:
df.sort_values(by='Score',ascending=False)

      Name  Age Gender  Score
2  Charlie   22      M     92
4      Eva   23      F     88
0    Alice   23      F     85
1      Bob   25      M     78

In [13]:
def assigngrade(score):
    if score>=90:
        return 'A'
    elif 80<=score<90:
        return 'B'
    elif 70<=score<60:
        return 'C'
    else:
        return 'D'
    
df['Grade']=df['Score'].apply(assigngrade)

In [14]:
df

      Name  Age Gender  Score Grade
0    Alice   23      F     85     B
1      Bob   25      M     78     D
2  Charlie   22      M     92     A
4      Eva   23      F     88     B

In [16]:
df1=pd.DataFrame({'Month':['Jan','Feb','Mar','Jan','Feb','Mar'],'Product':['A','A','A','B','B','B'],'Sales':[150,200,250,300,400,500]})
df1

  Month Product  Sales
0   Jan       A    150
1   Feb       A    200
2   Mar       A    250
3   Jan       B    300
4   Feb       B    400
5   Mar       B    500

In [24]:
total_sales=df1.groupby('Product')['Sales'].sum()
print(total_sales)

Product
A     600
B    1200
Name: Sales, dtype: int64

In [ ]:
df

In [9]:
max_sales_month=df1.loc[df1.groupby('Product')['Sales'].idxmax()]
print(max_sales_month)

  Month Product  Sales  Sales_percent
2   Mar       A    250      41.666667
5   Mar       B    500      41.666667

In [10]:
#for percentage=sales/total of that product
import pandas as pd
df1=pd.DataFrame({'Month':['Jan','Feb','Mar','Jan','Feb','Mar'],'Product':['A','A','A','B','B','B'],'Sales':[150,200,250,300,400,500]})
df1['Sales_percent']=df1.groupby('Product')['Sales'].apply(lambda x: (x/(x.sum())*100))
df1

C:\Users\user\AppData\Local\Temp\ipykernel_8936\1626887369.py:4: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df1['Sales_percent']=df1.groupby('Product')['Sales'].apply(lambda x: (x/(x.sum())*100))

  Month Product  Sales  Sales_percent
0   Jan       A    150      25.000000
1   Feb       A    200      33.333333
2   Mar       A    250      41.666667
3   Jan       B    300      25.000000
4   Feb       B    400      33.333333
5   Mar       B    500      41.666667

In [11]:
df2=pd.DataFrame({'Name':['John','Doe','Jane','Anna','Smith'],'Department':['HR','Finance',None,'IT','HR'],'Salary':[50000,60000,55000,None,58000]})
df2

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [12]:
df2.isna().sum()

Name          0
Department    1
Salary        1
dtype: int64

In [15]:
df2['Department']=df2['Department'].fillna(df2['Department'].mode()[0])

In [17]:
df2

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [18]:
df2['Salary']=df2['Salary'].fillna(df2['Salary'].mean())
df2

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [19]:
df_remove=df2.dropna(axis=0)
df_remove

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [20]:
se=pd.Series([23,21,20,25,27,30,28,22,24,26])
se

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

In [21]:
se.mean()

24.6

In [22]:
se.median()

24.5

In [23]:
se.std()

3.204163957519444

In [24]:
celsius=(se-32)*5/9

In [25]:
celsius

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

In [26]:
se.max()

30

In [27]:
se.idxmax()

5

In [28]:
se.idxmin()

2

In [31]:
se.sort_values()

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [35]:
se.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64